# ================================================================================================================
# IF ELIF ELSE
# ================================================================================================================
# if вычисляет и оценивает выражения одно за другим. 
# После первого True выражения, последующие инструкции elif/else не вычисляются и не оцениваются, а блоки кода в них не выполняется. 
# Если все выражения False, выполняется блок кода инструкции else, если он присутствует.

# elif является заменой для конструкции switch или case.

# Самый высокий приоритет у операции not.
# Следующий приоритет имеет операция and.
# Самый маленький приоритет у операции or.

# Любой непустой контейнер (строка, кортеж, список, словарь, множество) = True
# Нуль (любого числового типа), None и пустой контейнер = False


a = 5
b = 10
if a > b:
    print('a > b')
elif a < b:
    print('a < b')
else:
    print('a = b')


# ================================================================================================================
# IF В ОДНУ СТРОКУ
# ================================================================================================================
a = 10
b = 5

# выражение в 1 строку с передачей результата в переменную
x = a if a < b else b
print(x)                       # 5

# запись в 1 строку 
if a > b: print('a > b')       # a > b

# ================================================================================================================
# ИМИТАЦИЯ SWITCH/CASE ЧЕРЕЗ IF
# ================================================================================================================
fruit = "banana"
if fruit == "apple":
    print("The fruit is apple")
elif fruit == "banana":
    print("The fruit is banana")
elif fruit in ("blueberries", "raspberries", "blue currant", "currant"):
    print("The fruit is berries")
else:
    print("The fruit is unknown")





