# ================================================================================================================
# ФАЙЛОВЫЕ ОБЪЕКТЫ 
# ================================================================================================================
read_f = open('foo.txt')                  # create file object
read_f.close()                            # close object

# читаем из файла
for line in open('foo.txt', 'r'):
    print(line)

# пишем в файл
l = [4,5,6,7,8]
write_f = open('foo.txt', 'w')            # открывает файл для записи
for i in l:
    print(i, file=write_f)                # file указывает куда записать данные, по умолчанию file=sys.stdout
    # write_f.write(i)                    # так тоже можно записать
write_f.close()


# менеджер контекста для открытия файла
# close() прописывать не нужно
with open('foo.txt', 'r') as f_read:
    f_read.readline()

# ================================================================================================================
# ПОТОКИ ВВОДА И ВЫВОДА sys.stdin и sys.stdout - ЭТО ФАЙЛЫ
# ================================================================================================================

# ===== чтение ввода пользователя ==
name = input('Введите свое имя :')        # примет строку. Может потребоваться преобразование, если нужен другой тип

# ===== вывод данных на экран ======
import sys
sys.stdout.write('Введите свое имя :')
name = sys.stdin.readline()
