# ================================================================================================================
# TUPLE
# ================================================================================================================
# неизменяемый тип данных, tuple упорядочен, индексы и срезы, может быть ключом словаря
# хранит указатели на другие объекты
# работает быстрее списка
# весит меньше списка - 32 байта
# пустой кортеж - всегда только 1 в памяти(синглтон)

dir(())
['__add__', '__class__', '__contains__', '__delattr__', '__dir__', '__doc__', '__eq__', '__format__', '__ge__', '__getattribute__', '__getitem__', '__getnewargs__', '__gt__', '__hash__', '__init__', '__init_subclass__', '__iter__', '__le__', '__len__', '__lt__', '__mul__', '__ne__', '__new__', '__reduce__', '__reduce_ex__', '__repr__', '__rmul__', '__setattr__', '__sizeof__', '__str__', '__subclasshook__', 'count', 'index']


###### Методы =======================================================================
tuple.insert(i, x)              # служит для добавления элемента на указанную позицию( i – позиция, x – элемент)
tuple.count(x)                  # посчитает количество элементов x в списке
tuple.index(x)                  # вернет позицию первого найденного элемента x в списке
(2, 4, 10) + (1, 2)             # (2, 4, 10, 1, 2)
(2, 4, 10) * 2                  # (2, 4, 10, 2, 4, 10)

###### Сортировка по убыванию =======================================================
elements = [3, 56, 23, 99, 102, 44, 6]
sorted_tuple = tuple(sorted(elements, reverse=True))     # (102, 99, 56, 44, 23, 6, 3)

###### Перевести в строку ===========================================================
cars_tuple = ('audi', 'bmw', 'volvo', 'opel', 'volvo')
elements_to_str = ', '.join(cars_tuple)                  # audi, bmw, volvo, opel, volvo

###### Перевести в список ===========================================================
list(cars_tuple)

###### Перевести к set(множеству) ===================================================
print(set(elements))

###### Перевести в словарь ==========================================================
cars_tuple_to_dict = {x : cars_tuple[x] for x in range(len(cars_tuple))}
# {0: 'audi', 1: 'bmw', 2: 'volvo', 3: 'opel', 4: 'volvo'}

cars_tuple_to_enum_dict = dict(enumerate(cars_tuple)) 
# {0: 'audi', 1: 'bmw', 2: 'volvo', 3: 'opel', 4: 'volvo'}

###### Перевести в индексированный кортеж ===========================================
cars_tuple_to_enum_tuple = tuple(enumerate(cars_tuple))   
# ((0, 'audi'), (1, 'bmw'), (2, 'volvo'), (3, 'opel'), (4, 'volvo'))

###### Перевести в JSON =============================================================
import json
list_to_json = json.dumps(cars)
print(list_to_json)






