bytes
bytearray           От типа bytes отличается только тем, что является изменяемым. 
memoryview          https://docs-python.ru/tutorial/metody-tipa-memoryview-python/

Все операции ввода-вывода осуществляют в байтах, пока вы не сообщите системе кодировку для преобразования этих данных в текст.
# ================================================================================================================
# BYTES
# ================================================================================================================
# неизменяемый тип
# Бит - 0 или 1. Базовая единица информации, которой оперируют вычислительные устройства.
# Байт = 8 бит 00000001 - минимальная единица хранения и обработки цифровой информации. Последовательность байт представляет собой какую-либо информацию (текст, картинку, мелодию...).
# Байт может хранить число от 0 до 255.
# Байты в Питоне - это строки. Обычно их записывают или читают из файла.
# Для хранения пикселя нужно 3 байта (255, 255, 255) 


['__add__', '__class__', '__contains__', '__delattr__', '__dir__', '__doc__', '__eq__', '__format__', '__ge__', '__getattribute__', '__getitem__', '__getnewargs__', '__gt__', '__hash__', '__init__', '__init_subclass__', '__iter__', '__le__', '__len__', '__lt__', '__mod__', '__mul__', '__ne__', '__new__', '__reduce__', '__reduce_ex__', '__repr__', '__rmod__', '__rmul__', '__setattr__', '__sizeof__', '__str__', '__subclasshook__', 'capitalize', 'center', 'count', 'decode', 'endswith', 'expandtabs', 'find', 'fromhex', 'hex', 'index', 'isalnum', 'isalpha', 'isascii', 'isdigit', 'islower', 'isspace', 'istitle', 'isupper', 'join', 'ljust', 'lower', 'lstrip', 'maketrans', 'partition', 'replace', 'rfind', 'rindex', 'rjust', 'rpartition', 'rsplit', 'rstrip', 'split', 'splitlines', 'startswith', 'strip', 'swapcase', 'title', 'translate', 'upper', 'zfill']



https://www.youtube.com/watch?v=_inWIREh9jc

# 4 способа создать байтовую строку:
b'bytes'                                  # b'bytes'
bytes('bytes', encoding = 'utf-8')        # b'bytes'
'Байты'.encode('utf-8')                   # b'\xd0\x91\xd0\xb0\xd0\xb9\xd1\x82\xd1\x8b'  это кирилица в utf-8
bytes([50, 100, 76, 72, 41])              # b'2dLH)' список чисел от 0 до 255 и возвращает байты после функции chr.

# декодирование из байт в str
b'\xd0\x91\xd0\xb0\xd0\xb9\xd1\x82\xd1\x8b'.decode('utf-8')    # 'Байты'


# ===== Таблицы кодировки =======================================
utf-8               от 0 до 1 114 111()
ascii               от 0 до 127(7 бит)
chr(100)
Latin-1             базовая кодировка для Hypertext Transfer Protocol (HTTP) 
cp1252              вариант Latin-1 для Windows





list(b'\xf0\x9f\xa4\xa8')           [240, 159, 164, 168]


# одно и тоже число в разных системах счисления
int('11')                    # 11
int('11', base=10)           # 11 (десятичная система по умолчанию)
int('11', base=2)            # 3 двоичная
int('11', base=8)            # 9 восьмеричная
int('11', base=16)           # 17 шестнадцатеричная


0b11                         # 3 двоичный литерал
0o11                         # 9 восьмеричный литерал
0x11                         # 17 шестнадцатеричный литерал












# ================================================================================================================
# BYTEARRAY
# ================================================================================================================
# массив байт - изменяемый тип 

b = bytearray(b'hello world!')        # bytearray(b'hello world!')
b[0] = 105
print(b)                              # bytearray(b'iello world!')


# ================================================================================================================
# MEMORYVIEW - БУФЕР ОБМЕНА
# ================================================================================================================
