# ================================================================================================================
# ОБЛАСТЬ ВИДИМОСТИ ФУНКЦИИ
# ================================================================================================================




Фабрика — это объект для создания других объектов.
Простая фабрика генерирует экземпляр для клиента, не раскрывая никакой логики.


Это функция или метод, который возвращает объекты изменяющегося прототипа или класса из некоторого вызова метода, который считается «новым».



# ====== Когда использовать
Когда создание объекта — это не просто несколько присвоений, а какая-то логика, тогда имеет смысл создать отдельную фабрику вместо повторения одного и того же кода повсюду.





















