
# ================================================================================================================
# COMPOSITE(TREE, КОМПОНОВЩИК)
# ================================================================================================================
# Структурный паттерн проектирования
# Группирует множество объектов в древовидную структуру, чтобы работать с ней как с одним объектом
Все операции компоновщика основаны на рекурсии и «суммировании» результатов на ветвях дерева.
встречается в любых задачах, которые связаны с построением дерева. 


























