# ===========================================================================================
# МОНОСОСТОЯНИЕ -
# изменение любого атрибута в экземпляре меняет значение атрибута в классе и всех экземплярах
# ===========================================================================================
class Cat:
    __shared_attr = {
        'breed': 'pers'
    }

    def __init__(self):
        self.__dict__ = Cat.__shared_attr   # присваевает экземплярам 1 атрибут-словарь для всех экземпляров


a = Cat()
b = Cat()
print('a breed', a.breed)
print('b breed', b.breed)

b.breed = 'siam'

print('a breed', a.breed)
print('b breed', b.breed)

print(a.__dict__)
